app/controllers/wiki_pages_controller.rb

SELECT * FROM `wiki_pages`
---
  def index
    @wiki_pages = WikiPage.all

SELECT * FROM `wiki_pages` WHERE (`wiki_pages`.`id` = 1)
---
  def show
    @wiki_page = WikiPage.find(params[:id])

INSERT INTO `wiki_pages` (`slug`, `created_at`, `body`, `updated_at`) VALUES('First Page', '2009-08-27 17:46:00', 'This is the first Wiki Page', '2009-08-27 17:46:00')
---
  def create
    @wiki_page = WikiPage.new(params[:wiki_page])

    respond_to do |format|
      if @wiki_page.save